# This takes through simplest steps in data munging

In [1]:
import numpy as np
import pandas as pd
import pandas.io

In [4]:
df1=pd.read_csv("Grades1MissingData.csv")
df1.columns = ["name", "city", "subject", "marks", "MaxMark","grade"]
df1.head()

      name       city          subject marks MaxMark grade
0     John  Bangalore  Data Structures           100     B
1    Raman    Chennai  Data Structures    70     120     C
2   Venkat  Bangalore                     90     130     A
3     Rani      Delhi  Data Structures    95     100     A
4  Lakshmi     Mumbai       Algorithms    90             A

In [5]:
df1=pd.read_csv("Grades1MissingData.csv", keep_default_na = False, na_values=[  ""," "])
df1.columns = ["name", "city", "subject", "marks", "MaxMark","grade"]
print(df1.head(10))
df1.info() #Gives in how many rows some part of data is missing

      name       city          subject  marks  MaxMark grade
0     John  Bangalore  Data Structures    NaN    100.0     B
1    Raman    Chennai  Data Structures   70.0    120.0     C
2   Venkat  Bangalore              NaN   90.0    130.0     A
3     Rani      Delhi  Data Structures   95.0    100.0     A
4  Lakshmi     Mumbai       Algorithms   90.0      NaN     A
5     Syed    Kolkata        Compilers   92.0      NaN     A
6     Alok    Kolkata              NaN   80.0    130.0     B
7     Mehr     Mumbai  Data Structures   45.0      NaN     D
8  Abraham    Chennai       Algorithms   96.0    100.0     A
9      Jos  Bangalore        Compilers   59.0    120.0     D
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 6 columns):
name       21 non-null object
city       21 non-null object
subject    19 non-null object
marks      20 non-null float64
MaxMark    18 non-null float64
grade      21 non-null object
dtypes: float64(2), object(4)
memory usage: 1.1+ KB

In [5]:
pd.isna(df1.subject.head(10))

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
9    False
Name: subject, dtype: bool

In [4]:
pd.isna(df1["marks"]).head(10)

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: marks, dtype: bool

In [6]:
print(pd.isna(df1["subject"]).head())
print (np.sum(pd.isna(df1["subject"])))

0    False
1    False
2     True
3    False
4    False
Name: subject, dtype: bool
2

In [8]:
#Find number of missing data in column "marks"
np.sum(pd.isna(df1["marks"]))
print("pd.sum=",pd.isna(df1["marks"]).sum())

pd.sum= 1

In [27]:
#Find number of missing data in column "marks"
np.sum(pd.isna(df1["MaxMark"]))

3

In [9]:
#Fill Missing values differently for each column
newdf1 = df1.fillna({"MaxMark":120, "marks": 50, "subject": "Not Known"})
newdf1.head()

      name       city          subject  marks  MaxMark grade
0     John  Bangalore  Data Structures   50.0    100.0     B
1    Raman    Chennai  Data Structures   70.0    120.0     C
2   Venkat  Bangalore        Not Known   90.0    130.0     A
3     Rani      Delhi  Data Structures   95.0    100.0     A
4  Lakshmi     Mumbai       Algorithms   90.0    120.0     A

In [10]:
newdf1.to_csv("Grade1MissingCorrected.csv")